v0.9.6.4 & docs
